---
kind: other
id: Methods.T:Autodesk.Revit.DB.WallSweepInfo
source: html/21058342-705a-6f96-2c73-bc1131043867.htm
---
# WallSweepInfo Methods

Determines if the input object is equivalent to this WallSweepInfo.